//1. Дана строка, изображающая целое число. Вывести сумму цифр этого числа.
let str = "123";
let num = 0;
for (let i = 0; i < str.length; i++) {
  num += parseInt(str[i]);
}
console.log(num);

//2. Дана строка и символ. Удвоить каждое вхождение заданного символа в строку.
let str2 = "Мама мыла раму.";
let lstr2 = str2.toLowerCase();
let target ="м";
let str22 ="";

for (let i = 0; i < lstr2.length; i++) {
  str22 += lstr2[i];
  if (lstr2[i] === target) {
    str22 += target;
  }
}
console.log(str22);


// 3. Проверить что введенный пароль удовлетворяет 
// следующим условиям сложности:
// - длинна от 9 символов;
// - содержит обязательно английские буквы верхнего и нижнего регистра;
// - содержит более двух цифр;
// - содержит обязательно один из неалфавитных символов (например, !, $, #, %).

let str3 = prompt("Введите пароль:","");

let long = false;
    up = false,
    down = false,
    num = false,
    sym = false;

if (/.{9,}/.test(str3))
    long = true;
if (/(\d\D*){3,}/.test(str3))
    num = true;
if (/[A-Z]/.test(str3))
    up = true;
if (/[a-z]/.test(str3))
    down = true;
if (/\W/.test(str3))
    sym = true;

let res = `Длина > 9 символов: ${long}\nЕсть 3 цифры: ${num}\nЕсть заглавные буквы лат. алфавита: ${up}\nЕсть строчные буквы лат. алфавита: ${down}\nЕсть спецсимволы: ${sym}`;
alert(res);


// 4** Нечёткий поиск:
// Дана строка-словарь, например: "Понедельник Вторник Среда Четверг Пятница 
// Суббота Воскресенье". Пользователь вводит слово из словаря с одной 
// перепутанной буквой, например: "Срида". Написать программу, которая 
// позволяет с использованием регулярного выражения найти в строке-словаре 
// введённое пользователем слово (не смотря на одну ошибку в слове) и 
// вывести исправленное слово пользователю, например: "Среда".

let day = prompt("Введите день недели:","");
 
    // if (/[а-я]+н[а-я]*д[а-я]+к/i.test(day))
    // console.log("Понедельник");
    // if (/в[а-я]*р[а-я]*к/i.test(day))
    // console.log("Вторник");
    // if (/с[а-я]*д[а-я]*/i.test(day))
    // console.log("Среда");      
    // if (/ч[а-я]*г/i.test(day))
    // console.log("Четверг");   
    // if (/[а-я]?я[а-я]*ц[а-я]?/i.test(day))
    // console.log("Пятница");
    // if (/[а-я]*[уб][а-я]*/i.test(day))
    // console.log("Суббота");
    // if (/в[а-я]*к[а-я]*[се][а-я]*/i.test(day))
    // console.log("Воскресенье");

    if ((/[^п]онедельник/i.test(day)) || (/п[^о]недельник/i.test(day)) || (/по[^н]едельник/i.test(day)) || (/пон[^е]дельник/i.test(day)) || (/поне[^д]ельник/i.test(day)) || (/понед[^е]льник/i.test(day)) || (/понеде[^л]ьник/i.test(day)) || (/понедел[^ь]ник/i.test(day)) || (/понедель[^н]ик/i.test(day)) || (/понедельн[^и]к/i.test(day)) || (/понедельни[^к]/i.test(day))) {
        alert("Понедельник");
    }

    if((/[^в]торник/i.test(day)) || (/в[^т]орник/i.test(day)) || (/вт[^о]рник/i.test(day)) || (/вто[^р]ник/i.test(day)) || (/втор[^н]ик/i.test(day)) || (/вторн[^и]к/i.test(day)) || (/вторни[^к]/i.test(day))) {
        alert("Вторник");
    }    
    
    if ((/[^с]реда/i.test(day)) || (/с[^р]еда/i.test(day)) ||  (/ср[^е]да/i.test(day)) || (/сре[^д]а/i.test(day)) || (/сред[^а]/i.test(day))) {
        alert("Среда");
    } 
       
    if ((/[^ч]етверг/i.test(day)) || (/ч[^е]тверг/i.test(day)) ||  (/че[^т]верг/i.test(day)) || (/чет[^в]ерг/i.test(day)) || (/четв[^е]рг/i.test(day)) || (/четве[^р]г/i.test(day)) || (/четвер[^г]/i.test(day))) {
        alert("Четверг");
    } 

    if ((/[^п]ятница/i.test(day)) || (/п[^я]тница/i.test(day)) ||  (/пя[^т]ница/i.test(day)) || (/пят[^н]ица/i.test(day)) || (/пятн[^и]ца/i.test(day)) || (/пятни[^ц]а/i.test(day)) || (/пятниц[^а]/i.test(day))) {
        alert("Пятница");
    } 

    if ((/[^с]уббота/i.test(day)) || (/с[^у]ббота/i.test(day)) ||  (/су[^б]бота/i.test(day)) || (/суб[^б]ота/i.test(day)) || (/субб[^о]та/i.test(day)) || (/суббо[^т]а/i.test(day)) || (/суббот[^а]/i.test(day))) {
        alert("Суббота");
    }

    if ((/[^в]оскресенье/i.test(day)) || (/в[^о]скресенье/i.test(day)) || (/во[^с]кресенье/i.test(day)) || (/вос[^к]ресенье/i.test(day)) || (/воск[^р]есенье/i.test(day)) || (/воскр[^е]сенье/i.test(day)) || (/воскре[^с]енье/i.test(day)) || (/воскрес[^е]нье/i.test(day)) || (/воскресе[^н]ье/i.test(day)) || (/воскресен[^ь]е/i.test(day)) || (/воскресень[^е]/i.test(day))) {
        alert("Воскресенье");
    }
    
        
    
  
    



    

    